{
    "Basil___Healthy": "Maintain a regular watering schedule, keeping the soil consistently moist but not waterlogged. Plant basil in well-draining soil with plenty of organic matter. Ensure the basil receives at least 6-8 hours of sunlight daily. Prune regularly to encourage bushier growth and prevent the plant from becoming leggy.",
    "Basil___Wilted": "Check the soil moisture levels and ensure it is not too dry or too waterlogged. Improve soil drainage if necessary and avoid watering the leaves directly to prevent fungal infections. Ensure the plant is receiving adequate sunlight and is not exposed to extreme temperatures. Remove any damaged leaves and provide a balanced fertilizer to boost plant health.",
    "Bok_Choy___Healthy": "Plant bok choy in fertile, well-drained soil. Provide consistent moisture to keep the soil evenly moist but not waterlogged. Ensure the plant gets at least 4-6 hours of sunlight daily. Mulch around the plants to retain moisture and regulate soil temperature. Regularly check for pests and diseases and address any issues promptly.",
    "Bok_Choy___Leaf_With_Symptoms": "Remove any affected leaves immediately to prevent the spread of disease. Ensure proper spacing between plants to improve air circulation and reduce humidity around the leaves. Avoid overhead watering and water the base of the plant instead. Use organic compost or mulch to prevent soil-borne diseases from splashing onto the leaves. Apply appropriate fungicides or insecticides if necessary.",
    "Lettuce___Healthy": "Plant lettuce in rich, well-draining soil with plenty of organic matter. Provide consistent moisture, keeping the soil evenly moist but not soggy. Ensure the lettuce receives partial to full sunlight, depending on the variety. Thin seedlings to allow proper air circulation and prevent overcrowding. Monitor for pests and diseases, and address any issues promptly.",
    "Lettuce___Leaf_Spot_Disease": "Remove infected leaves immediately and dispose of them properly. Avoid overhead watering and water the soil directly to keep the foliage dry. Rotate crops regularly and avoid planting lettuce in the same spot year after year. Use a copper-based fungicide to treat the disease and prevent its spread. Ensure proper spacing between plants to improve air circulation.",
    "Mint___Healthy": "Plant mint in a sunny or partially shaded location with well-draining soil. Water regularly to keep the soil consistently moist but not waterlogged. Harvest mint leaves frequently to encourage bushier growth. Mint is a vigorous grower, so consider planting it in a container to prevent it from spreading uncontrollably.",
    "Mint___Leaf_Spot_Disease": "Remove affected leaves and dispose of them properly. Avoid overhead watering and water the base of the plant to keep the leaves dry. Improve air circulation around the plants by providing adequate spacing. Apply a fungicide specifically formulated for leaf spot diseases if necessary. Mulch around the plants to prevent soil-borne spores from splashing onto the leaves.",
    "Strawberry___Healthy": "Plant strawberries in well-draining soil rich in organic matter. Ensure they receive at least 6-8 hours of sunlight daily. Water the plants regularly, keeping the soil evenly moist but not waterlogged. Mulch around the plants to retain moisture and prevent weeds. Remove runners to focus the plant's energy on producing fruit.",
    "Strawberry___Leaf_Scorch": "Remove and destroy any affected leaves to prevent the spread of the disease. Ensure the plants are well-watered, especially during dry periods, but avoid overwatering. Improve air circulation by providing adequate spacing between plants. Apply a balanced fertilizer to strengthen the plants' overall health. Use appropriate fungicides if necessary, following the label instructions carefully."
}
